#Exp-3

In [ ]:
#Aim: Creating the Dataframe

In [1]:
# Name:Vedant Arvind Bhagwat
# Roll no-:73
# sec : B
#Subject:ET1
# Date:07/08/25

# Creating series

In [1]:
import pandas as pd

In [2]:
Name=["Pratik","Dev","Vedant","Om","Ram"]

In [3]:
Name

['Pratik', 'Dev', 'Vedant', 'Om', 'Ram']

In [4]:
Roll_list=pd.Series(Name,index=[1,2,3,4,5])
print(Roll_list)

1    Pratik
2       Dev
3    Vedant
4        Om
5       Ram
dtype: object

# Creating Datab Frame

In [5]:
df=pd.DataFrame([[10,12,14,16],[11,18,15,21],[12,13,14,15]],
               columns=["CD","DBMS","DSS","CAO"])

In [6]:
df

   CD  DBMS  DSS  CAO
0  10    12   14   16
1  11    18   15   21
2  12    13   14   15

In [7]:
df.shape

(3, 4)

In [8]:
df.size

12

In [9]:
df.ndim

2

# Adding Record (Row)to the data frame

In [12]:
df

   CD  DBMS  DSS  CAO
0  10    12   14   16
1  11    18   15   21
2  12    13   14   15

In [13]:
df2=pd.DataFrame([[10,12,14,16]],
columns=["CD","DBMS","DSS","CAO"])

In [15]:
df3=pd.concat([df,df2], ignore_index=True)

In [16]:
df3

   CD  DBMS  DSS  CAO
0  10    12   14   16
1  11    18   15   21
2  12    13   14   15
3  10    12   14   16

# Deleting Record from df3 dataframe

In [17]:
df4=df3.drop(index=[1])

In [18]:
df4

   CD  DBMS  DSS  CAO
0  10    12   14   16
2  12    13   14   15
3  10    12   14   16

# Adding Attribute (columns)to data frame

In [19]:
df3["DM"]=[11,22,33,44]

In [20]:
df3

   CD  DBMS  DSS  CAO  DM
0  10    12   14   16  11
1  11    18   15   21  22
2  12    13   14   15  33
3  10    12   14   16  44

# Deleting attribut (columns) from df3 dataframe

In [21]:
df5=df3.drop(columns=["DM"])

In [22]:
df5

   CD  DBMS  DSS  CAO
0  10    12   14   16
1  11    18   15   21
2  12    13   14   15
3  10    12   14   16

In [23]:
print("mean of dss:",df5["DSS"].mean())

mean of dss: 14.25

In [24]:
print("median of dss:",df5["DSS"].median())

median of dss: 14.0

In [25]:
print("mode of dss:",df5["DSS"].mode())

mode of dss: 0    14
Name: DSS, dtype: int64